Revit 2026 API

# ShapeImporterInputFormat Property

---

The format of the incoming data.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public ShapeImporterSourceFormat InputFormat { get; set; }
```
```vb
Public Property InputFormat As ShapeImporterSourceFormat
	Get
	Set
```
```cpp
public:
property ShapeImporterSourceFormat InputFormat {
	ShapeImporterSourceFormat get ();
	void set (ShapeImporterSourceFormat value);
}
```
```fsharp
member InputFormat : ShapeImporterSourceFormat with get, set
```

#### Property Value

ShapeImporterSourceFormat

| Exception | Condition |
| --- | --- |
| ArgumentOutOfRangeException | When setting this property: A value passed for an enumeration argument is not a member of that enumeration |

If this option is set to Auto (the default), the file name extension will be used to determine the input format. That covers most file-based data import workflows. Specify the input format explicitly to perform an additional sanity check or if you are using a non-standard file extension.

#### Reference

ShapeImporter Class

Autodesk.Revit.DB Namespace